In [1]:
import pandas as pd

In [7]:
data = {
    "nome":["teo", "nah", "lara", "maria"],
    "sobrenome":["calvo", "ataide", " calvo", "calvo"],
    "idade":[31, 32, 31, 2]
}

In [12]:
data["idade"][0]

31

In [14]:
df = pd.DataFrame(data)
df

    nome sobrenome  idade
0    teo     calvo     31
1    nah    ataide     32
2   lara     calvo     31
3  maria     calvo      2

In [20]:
df["idade"].iloc[0]

31

In [22]:
df["sobrenome"]

0     calvo
1    ataide
2     calvo
3     calvo
Name: sobrenome, dtype: object

In [28]:
type(df.iloc[1])

pandas.core.series.Series

In [30]:
df.iloc[1]

nome            nah
sobrenome    ataide
idade            32
Name: 1, dtype: object

In [32]:
df

    nome sobrenome  idade
0    teo     calvo     31
1    nah    ataide     32
2   lara     calvo     31
3  maria     calvo      2

In [34]:
df.columns

Index(['nome', 'sobrenome', 'idade'], dtype='object')

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [38]:
df.dtypes

nome         object
sobrenome    object
idade         int64
dtype: object

In [40]:
df.describe()

          idade
count   4.00000
mean   24.00000
std    14.67424
min     2.00000
25%    23.75000
50%    31.00000
75%    31.25000
max    32.00000

In [42]:
df['peso'] = [80 , 53, 65, 14]

In [44]:
df.describe()

          idade       peso
count   4.00000   4.000000
mean   24.00000  53.000000
std    14.67424  28.248894
min     2.00000  14.000000
25%    23.75000  43.250000
50%    31.00000  59.000000
75%    31.25000  68.750000
max    32.00000  80.000000

In [46]:
df.head(2)

  nome sobrenome  idade  peso
0  teo     calvo     31    80
1  nah    ataide     32    53

In [48]:
df.tail(2)

    nome sobrenome  idade  peso
2   lara     calvo     31    65
3  maria     calvo      2    14